{
    "review": [
        {
            "id": "A",
            "text": "It's awesome.  Camera is nice and cleared. While shoot a photo at night time or low lights it's given good clarity pictures. I felt Less heating during charge my mobile. Then while playing heavy processing games gets heated. Otherwise the phone is best one to choose this price.",
            "Expected categories": "Camera, Display, Battery (charging), processor speed"
        },
        {
            "id": "A",
            "text": "I have replaced two chargers. First one blew away just few days after 6 months warranty was over. Now again suddenly the phone is dead. Don't know if charger is dead again or this time the phone is gone.....bad experience.",
            "Expected categories": "Battery, over all performance"
        },
        {
            "id": "A",
            "text": "Ear piece volume is very low after upgrading and it's very frustrating to use this phone without a earphone.\r\n\r\nHave been chasing the customer care but it's not much of use as of now I plan to walk to their center in Bangalore now.",
            "Expected categories": "Sound, Service, over all performance"
        },
        {
            "id": "A",
            "text": "Love the camera and the body. The sleek design and the awesome RAM does not let you down ever. As one makes use of it on a daily level then the battery standby time decreases. It begins by giving a backup of 12-13 hours a day and then reduces to 9-10 hours over a period of an year",
            "Expected categories": "camera, Design, Processor, Battery, over all performance"
        },
        {
            "id": "A",
            "text": "Phone is very fast,sleek in design with latest hardware, but you will miss many features of other brands ",
            "Expected categories": "over all performance"
        },
        {
            "id": "A",
            "text": "Phone is good but as committed battery is very poor. Discharges 100% within 7-8 hours of use. Data corrupts automatically sometimes. I faced the same two times.",
            "Expected categories": "Battery, over all performance"
        },
        {
            "id": "A",
            "text": "Not at all suitable size is a few mm big gets lifted by the mobile cover",
            "Expected categories": "Design"
        },
        {
            "id": "A",
            "text": "Osam phone... Functions very smoothly...great interface....No lagging....10/10😍😍😍",
            "Expected categories": "over all performance"
        },
        {
            "id": "A",
            "text": "Phone slighty heats up even under normal usage....otherwise beast of a smartphone",
            "Expected categories": "over all performance"
        },
        {
            "id": "A",
            "text": "Extremely happy with the and also with Amazon service. one of the best smartphones in the market. True value for money. really worth it.",
            "Expected categories": "over all performance"
        },
        {
            "id": "A",
            "text": "Supb camera gud gaming everything is osm. Just heating prblm ...Other wise amazing smart phone I never used",
            "Expected categories": "camera, battery, over all performance"
        },
        {
            "id": "A",
            "text": "It's a beautiful device. Its as good as I expected it to be.\r\nI think they should give a tempered glass complimentary with the  Would be an awesome deal.",
            "Expected categories": "Design, over all performance"
        },
        {
            "id": "A",
            "text": "This phone meets all my expectations. Light weight with high processing speed and the camera with amazing picture quality!",
            "Expected categories": "Design, processor, camera, display, over all performance"
        },
        {
            "id": "A",
            "text": "Great phone for the given price, charges very quickly thanks to dash charging, camera quality is really good and overall performance is blazing fast",
            "Expected categories": "Battery, camera, over all performance"
        },
        {
            "id": "A",
            "text": "Brilliant phone. Stunning design. Good battery back up. Super fast. Worth buying. Just not too happy wid protruding camera lens.",
            "Expected categories": "Design, Battery, Processor, camera"
        }
    ]
}